In [1]:
import pandas as pd
import numpy as np
pop = pd.read_csv('../data/mock_sysselsatte/population_2019_30000.csv')
comp = pd.read_csv('../data/mock_sysselsatte/companies_2019_30000.csv')

### Crosstab

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html

In [2]:
pop

,Unnamed: 0,id,work_id,sex,age,year_birth,work_percent
0,0,29101946112,NaN,Menn,0,2019,NaN
1,1,26101930288,NaN,Menn,0,2019,NaN
2,2,22091952214,NaN,Menn,0,2019,NaN
3,3,4071997222,NaN,Menn,0,2019,NaN
4,4,7101970642,NaN,Menn,0,2019,NaN
...,...,...,...,...,...,...,...
29995,29995,15072660901,NaN,Kvinner,93,1926,NaN
29996,29996,23012604128,NaN,Kvinner,93,1926,NaN
29997,29997,14102931680,NaN,Kvinner,90,1929,NaN
29998,29998,29062932768,NaN,Kvinner,90,1929,NaN
29999,29999,11072931487,NaN,Kvinner,90,1929,NaN

In [3]:
# Antall kvinner og menn per alder
pd.crosstab(pop['age'], pop['sex'])

sex  Kvinner  Menn
age
0        151   161
1        174   150
2        164   184
3        168   185
4        170   160
..       ...   ...
96        17     6
97        14     7
98         9     6
99        14     7
100       22     6

[101 rows x 2 columns]

In [4]:
pop['age'].astype(str).str[:1].replace('', '0')

0        0
1        0
2        0
3        0
4        0
        ..
29995    9
29996    9
29997    9
29998    9
29999    9
Name: age, Length: 30000, dtype: object

In [5]:
# Gjennomsnittlig arbeidsprosent per kjønn og tiår
arbprc_ald_kjonn = pd.crosstab( 
            pop['age'].astype(str).str[:1].replace('', '0'), 
            pop['sex'], 
            values = pop['work_percent'].astype(float), 
            aggfunc = np.mean)
# Dataframes har en "round funksjon"...
arbprc_ald_kjonn.round()

sex  Kvinner  Menn
age
1       47.0  63.0
2       76.0  87.0
3       87.0  93.0
4       90.0  97.0
5       88.0  95.0
6       83.0  93.0
7       53.0  68.0

In [6]:
# Eller man kan bare konvertere til int?
arbprc_ald_kjonn.astype(int)

sex  Kvinner  Menn
age
1         47    62
2         75    86
3         86    93
4         89    96
5         87    95
6         83    92
7         53    67

### Bonus: "En påbegynt versjon av Proc Freq"

https://statisticsnorway.github.io/ssb_fellesfunksjoner_360/proc.html \
https://github.com/statisticsnorway/ssb_fellesfunksjoner_360/blob/Merge-nbdev-template/04_proc.ipynb

Lignende prosjekt er meldt inn av Kristian Lønø til Hack, for "proc tabulate" \
Denne pakken "fellesfunksjoner_360" er dokumentert og pakket ned til en "package" med "nbdev" - "Notebook development".